# Subcategory Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ModelText..::..Subcategory Property
ModelText Class See Also
---
The subcategory.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Category Subcategory { get; set; }
```

Visual Basic
---
```text
Public Property Subcategory As Category
	Get
	Set
```

Visual C++
---
```text
public:
property Category^ Subcategory {
	Category^ get ();
	void set (Category^ value);
}
```

# Remarks
The subcategory can be set to either the family category or one of its subcategories.
# See Also
ModelText Class
Autodesk.Revit.DB Namespace